<!--#include virtual="/header.html"-->
<title>Prehistory of digital fonts
       - TUGboat 44:1 (2023) - TeX Users Group</title>
</head><body>

<a href="/TUGboat/"><img
         align=right width=139 height=150 src="/TUGboat/press72-small.jpg"></a>

<h1><a href="/TUGboat/tb44-1/">TUGboat 44:1</a> (2023)<br>
<small>The Communications of the <a href="/">TeX Users Group</a></small></h1>

<p><b>Title</b>: Prehistory of digital fonts</p>

<p><b>Summary</b>:
extensive examination of the foundational research in digital typography, profusely illustrated.</p>

<p><b>Full text of article</b>: <a href="https://tug.org/members/TUGboat/tb44-1/tb136andre-prehistory.pdf">available to TUG members</a> (<a href="/join.html">join TUG</a>);
will be publicly available after the next issue is published.</p>

<p><b>Author</b>:
<a href="/TUGboat/Contents/listauthor.html#Andre,Jacques">Jacques Andr&#xe9;</a></p>

<p><b>Publication</b>: <a href="/TUGboat/tb44-1/">TUGboat
volume 44, number 1</a> (2023),
pages&nbsp;21-57</p>

<p><b>DOI</b> (this page):
<a href="https://doi.org/10.47397/tb/44-1/tb136andre-prehistory">10.47397/tb/44-1/tb136andre-prehistory</a>
<br><small>(<a href="https://doi.org/10.47397/tb/44-1/tb136carter-romano">previous doi</a>
- <a href="https://doi.org/10.47397/tb/44-1/tb136inn">next doi</a>)</small></p>

<p><b>Category</b>:
<a href="/TUGboat/Contents/listkeyword.html#CatTAGFonts">Fonts</a></p>
      
<p><b>Difficulty</b>: Intermediate</p>

<p><b>Abstract</b>:
Over the second half of the 20th century, typography moved from physical
metal type to the abstractions of digital computing. This revolution
did not follow a straight path. We examine here some of the very first
attempts to produce printed characters on computers.</p>
<p>In the 1950s, to satisfy the needs of physicists, the first vectorized
letters (and numbers, signs, &#x2026;) were made on CRT screens and
plotters. In the 1960s, the dot matrix concept allowed consideration of
characters as surfaces, leading to digital phototypesetting. In the
1970s, thanks to research in computer-aided design, the way was opened
to the fundamentals of digital letter outlines. The first font formats
occurred in the late 1970s. The innovation of laser printers, around
1985, marked the beginning of the mature rendering of digital fonts, and
the beginning of the commercial font wars, where we will leave off.</p>

<p><b>References</b>:</p>
<ol class="tugbbl">
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; De Gutenberg au XVII&#x1D49; si&#x00E8;cle, by Yves Perrousseaux. Atelier Perrousseaux &#x00e9;d./Adverbum, 2004.</li>
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; Le XVIII&#x1D49; si&#x00E8;cle, tome I/II, by Yves Perrousseaux. Atelier Perrousseaux &#x00e9;d./Adverbum, 2010.</li>
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; Le XVIII&#x1D49; si&#x00E8;cle, tome II/II, by Yves Perrousseaux. Atelier Perrousseaux &#x00e9;d./Adverbum, 2010.</li>
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; Le XIX&#x1D49; si&#x00E8;cle fran&#x00e7;ais, by Jacques Andr&#x00e9; and Christian Laucou. Atelier Perrousseaux &#x00e9;d./Adverbum, 2013.</li>
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; Le XX&#x1D49; si&#x00E8;cle, de 1900 &#x00e0; 1950, collective work under the direction of Jacques Andr&#x00e9;. Atelier Perrousseaux &#x00e9;d./Adverbum, 2016.</li>
<li class="tugbbl">Histoire de l&#x2019;&#x00e9;criture typographique &#x2013; Le XX&#x1D49; si&#x00E8;cle, de 1950 &#x00e0; 2000, collective work under the direction of Jacques Andr&#x00e9;. Atelier Perrousseaux &#x00e9;d./Adverbum, 2016.</li>
<li class="tugbbl">Adobe Systems Inc., PostScript Language Reference Manual, first edition, Reading, MA: Addison-Wesley, 1985; second edition, 1991.</li>
<li class="tugbbl">Adobe Systems Inc., PostScript Language Tutorial and Cookbook, Reading, MA: Addison-Wesley, 1985.</li>
<li class="tugbbl">Adobe Systems Inc., PostScript Language Program Design, Reading, MA: Addison-Wesley, 1988.</li>
<li class="tugbbl">Adobe Systems Inc., The Type 1 Format Specification, Reading, MA: Addison-Wesley, 1990.</li>
<li class="tugbbl">Jacques Andr&#x00e9;, Cr&#x00e9;ation de fontes en typographie num&#x00e9;rique, M&#x00e9;moire d&#x2019;HDR, Universit&#x00e9; Rennes I, 29 sept. 1993, 124 pp. <a href="https://theses.hal.science/tel-00011218/file/andre.pdf">theses.hal.science/tel-00011218/file/andre.pdf</a></li>
<li class="tugbbl">Jacques Andr&#x00e9;, Courier &#x2013; Histoire d&#x2019;un caract&#x00e8;re &#x2013; De la machine &#x00e0; &#x00e9;crire aux fontes num&#x00e9;riques, &#x00e9;d. du Jobet, 1993. <a href="https://jacques-andre.fr/fontex/courier.pdf">jacques-andre.fr/fontex/courier.pdf</a></li>
<li class="tugbbl">Jacques Andr&#x00e9;, De Pacioli &#x00e0; Truchet : trois si&#x00e8;cles de g&#x00e9;om&#x00e9;trie pour les caract&#x00e8;res, 4 000 ans d&#x2019;histoire des math&#x00e9;matiques : les math&#x00e9;matiques dans la longue dur&#x00e9;e &#x2013; 13&#x1D49; colloque Inter-IREM d&#x2019;&#x00e9;pist&#x00e9;mologie et histoire des math&#x00e9;matiques, IREM-Rennes, mai 2000, pp. 1&#x2013;38. <a href="https://hal.inria.fr/inria-00000956">hal.inria.fr/inria-00000956</a></li>
<li class="tugbbl">Jacques Andr&#x00e9; and Justin Bur, M&#x00e9;trique des fontes PostScript, Cahiers Gutenberg, n&#x00b0; 8 (1991), pp. 29&#x2013;50. <a href="http://numdam.org/item/CG_1991___8_29_0/">numdam.org/item/CG_1991___8_29_0/</a></li>
<li class="tugbbl">Jacques Andr&#x00e9; and Denis Girou, Father Truchet, the typographic point, the Romain du roi, and tilings, TUGboat, Vol. 20 (1999), No. 1, pp. 8&#x2013;14. <a href="https://tug.org/TUGboat/tb20-1/tb62andr.pdf">tug.org/TUGboat/tb20-1/tb62andr.pdf</a></li>
<li class="tugbbl">Jacques Andr&#x00e9; and Alan Marshall, Richard Southall: 1937&#x2013;2015, TUGboat, Vol. 36 (2015), No. 2, pp. 100&#x2013;102. <a href="https://tug.org/tugboat/tb36-2/tb113southall.pdf">tug.org/tugboat/tb36-2/tb113southall.pdf</a></li>
<li class="tugbbl">Jacques Andr&#x00e9; and Moncef Mlouka (eds.), Workshop on Font Design Systems, INRIA-Sophia, May 1987. See also [109] (1989).</li>
<li class="tugbbl">Augustin, Wim Crouwel, Index Grafik, 7 avril 2014. <a href="http://indexgrafik.fr/wim-crouwel/">indexgrafik.fr/wim-crouwel/</a></li>
<li class="tugbbl">Patrick Baudelaire, The Fred User&#x2019;s Manual, Internal Report, Xerox Palo Alto Research Center, Palo Alto, California, 1976.</li>
<li class="tugbbl">Patrick Baudelaire, The Xerox Alto Font Design System, in [31].</li>
<li class="tugbbl">Patrick Baudelaire and M. Stone, Techniques for Interactive Raster Graphics, SIGGRAPH 80 Proceedings, Computer Graphics, Vol. 14, No. 3, 1980.</li>
<li class="tugbbl">Barbara Beeton, Karl Berry and David Walden, TeX: A Branch in Desktop Publishing Evolution, Part 1, IEEE Annals of the History of Computing, Vol. 40, No. 3, Jul./Sept. 2018, pp. 78&#x2013;93. <a href="https://ieeexplore.ieee.org/document/8509554/">ieeexplore.ieee.org/document/8509554/</a></li>
<li class="tugbbl">Yves Bekkers, Daniel Herman, and Michel Raynal, Conception et r&#x00e9;alisation d&#x2019;une machine-langage de haut niveau adapt&#x00e9;e &#x00e0; l&#x2019;&#x00e9;criture de syst&#x00e8;mes, Ph.D. thesis, Rennes University, 24 sept. 1975.</li>
<li class="tugbbl">Charles Bigelow, Les caract&#x00e8;res rationalis&#x00e9;s, in La manipulation de documents (Jacques Andr&#x00e9;, ed.), INRIA-Centre de Rennes, mai 1983, pp. 15-27. <a href="https://jacques-andre.fr/japublis/manip83.pdf">jacques-andre.fr/japublis/manip83.pdf</a></li>
<li class="tugbbl">Charles Bigelow, Review and Summaries of The History of Typographic Writing&#x2014;The 20th century. Originally published in three parts in TUGboat Vol. 38 (2017); combined: <a href="https://tug.org/books/reviews/tv38bigelow.pdf">tug.org/books/reviews/tv38bigelow.pdf</a></li>
<li class="tugbbl">Charles Bigelow, Typeface Features and Legibility Research, Vision Research, Vol. 165, Dec. 2019, pp. 162&#x2013;172. <a href="https://doi.org/10.1016/j.visres.2019.05.003">doi.org/10.1016/j.visres.2019.05.003</a></li>
<li class="tugbbl">Charles Bigelow, The Font Wars, Parts 1 and 2, IEEE Annals of the History of Computing (Special issue: History of Desktop Publishing), Vol. 42, No. 1, Jan./Mar. 2020, pp. 7&#x2013;40. <a href="https://doi.org/10.1109/MAHC.2020.2971202">doi.org/10.1109/MAHC.2020.2971202</a> and <a href="https://doi.org/10.1109/MAHC.2020.2971745">doi.org/10.1109/MAHC.2020.2971745</a></li>
<li class="tugbbl">Charles Bigelow and Donald Day, Digital Typography, Scientific American, Vol. 249, No. 2, pp. 106&#x2013;119, Aug. 1983.</li>
<li class="tugbbl">Charles Bigelow and Kris Holmes, Notes on Apple 4 Fonts, Electronic Publishing, Vol. 4, No. 3, Sept. 1991, pp. 171&#x2013;181. <a href="http://cajun.cs.nott.ac.uk/compsci/epo/papers/volume4/issue3/ep050cb.pdf">cajun.cs.nott.ac.uk/compsci/epo/papers/volume4/issue3/ep050cb.pdf</a></li>
<li class="tugbbl">Charles Bigelow and Kris Holmes, The Design of Lucida: An Integrated Family of Types for Electronic Literacy, in Text Processing and Document Manipulation (J.C. van Vliet, ed.), Cambridge University Press, 1986.</li>
<li class="tugbbl">Charles Bigelow and Kevin Larson (eds.), Visible Language (Special issue: Reflecting on 50 Years of Typography, Vol. 50, No. 2, Aug. 2016. <a href="https://journals.uc.edu/index.php/vl/issue/view/461">journals.uc.edu/index.php/vl/issue/view/461</a></li>
<li class="tugbbl">Charles Bigelow and Lynn Ruggles (eds.), Visible Language (Special issue: The Computer and the Hand in Type Design), Vol. 19, No. 1, Winter 1985. <a href="https://journals.uc.edu/index.php/vl/issue/view/369">journals.uc.edu/index.php/vl/issue/view/369</a></li>
<li class="tugbbl">Alison Black, Typefaces for Desktop Publishing: A User Guide, London: Architecture Design and Technology Press, 1990.</li>
<li class="tugbbl">Lewis Blackwell, 20th-Century Types, Lawrence King Publishing, 2004.</li>
<li class="tugbbl">G&#x00e9;rard Blanchard (coordinated by), L&#x2019;&#x00e9;criture t&#x00e9;l&#x00e9;matique, ann&#x00e9;es z&#x00e9;ro, Les Cahiers de Lure, 1985.</li>
<li class="tugbbl">G&#x00e9;rard Blanchard, L&#x2019;eredita Gutenberg, Gianfranco Altieri Editore, 1989.</li>
<li class="tugbbl">G&#x00e9;rard Blanchard, Aide au choix de la typo-graphie &#x2013; Cours sup&#x00e9;rieur, Atelier Perrousseaux &#x00e9;d., 1998.</li>
<li class="tugbbl">Paul Bourke, Hershey Vector Font based on the Hershey character set, Oct. 1977. <a href="http://paulbourke.net/dataformats/hershey/">paulbourke.net/dataformats/hershey/</a></li>
<li class="tugbbl">Jack E. Bresenham, Algorithm for computer control of a digital plotter, IBM Systems Journal, Vol. 4, No. 1, Jan. 1965, pp. 25&#x2013;30. <a href="https://doi.org/10.1147/sj.41.0025">doi.org/10.1147/sj.41.0025</a></li>
<li class="tugbbl">Robert Bringhurst, The Elements of Typographic Style, Hartley &#x0026; Marks publishers, 4th edition, 2015.</li>
<li class="tugbbl">CalComp Software Reference Manual, California Computer Products Inc., Oct. 1976. <a href="https://archive.org/details/bitsavers_calcompCalceManualOct76_6872751">archive.org/details/bitsavers_calcompCalceManualOct76_6872751</a></li>
<li class="tugbbl">Edward M. Catich, The Origin of the Serif: Brush Writing and Roman Letters, Davenport, IA: The Catfish Press, 1968.</li>
<li class="tugbbl">Philippe J.M. Coueignoux, Generation of Roman Printed Fonts, Ph.D. thesis, Massachusetts Institute of Technology, Dept. of Electrical Engineering and Computer Science, 1975. <a href="https://dspace.mit.edu/bitstream/handle/1721.1/27408/02149218-MIT.pdf">dspace.mit.edu/bitstream/handle/1721.1/27408/02149218-MIT.pdf</a></li>
<li class="tugbbl">Dave Crossland, &#x201c;Why didn&#x2019;t Metafont catch on?&#x201d;, TUGboat, Vol. 29 (2008), No. 3, pp. 418-420. <a href="https://tug.org/TUGboat/tb29-3/tb93crossland.pdf">tug.org/TUGboat/tb29-3/tb93crossland.pdf</a></li>
<li class="tugbbl">Typographic Architectures typographiques, texts by Wim Hendrik Crouwel, Catherine de Smet and Emmanuel B&#x00e9;rard, Editions fsept F7, Paris, 2007.</li>
<li class="tugbbl">Jorge De Buen, Manual de dise&#x00f1;o editorial, Santilano, Mexico, 2000,</li>
<li class="tugbbl">Christian Delorme and Jacques Andr&#x00e9;, Le Delorme, un caract&#x00e8;re modulaire et d&#x00e9;pendant du contexte, Communication et langages, Vol. 86 (1990), pp. 64&#x2013;76. <a href="https://www.persee.fr/web/revues/home/prescript/article/colan_0336-1500_1990_num_86_1_2261">www.persee.fr/web/revues/home/prescript/article/colan_0336-1500_1990_num_86_1_2261</a></li>
<li class="tugbbl">Jean-Luc Devroye, Type Design, Typography, Typefaces and Fonts: An encyclopedic treatment of type design, typefaces and fonts. Web page closed on May 6, 2022. <a href="http://luc.devroye.org/fonts.html">luc.devroye.org/fonts.html</a></li>
<li class="tugbbl">Jean-Luc Devroye, Metafont links, in [48]. <a href="http://luc.devroye.org/metafont.html">luc.devroye.org/metafont.html</a></li>
<li class="tugbbl">Diderot &#x0026; D&#x2019;Alembert, Encyclop&#x00e9;die, ou Dictionnaire Raisonn&#x00e9; des Sciences, des Arts et des M&#x00e9;tiers, 1751&#x2013;1772. <a href="https://encyclopedie.uchicago.edu">encyclopedie.uchicago.edu</a></li>
<li class="tugbbl">Albrecht D&#x00fc;rer, Of the just shaping of letters. <a href="https://www.zigzaganimal.be/elements/just_shaping_scan.pdf">www.zigzaganimal.be/elements/just_shaping_scan.pdf</a></li>
<li class="tugbbl">Jean-Jacques Eltgen, Techniques d&#x2019;impression d&#x2019;images num&#x00e9;ris&#x00e9;es, Techniques de l&#x2019;ing&#x00e9;nieur, art. E-5-670, 1992.</li>
<li class="tugbbl">James Essinger, Jacquard&#x2019;s Web: How a hand loom led to the birth of the information age. Oxford, U.K.: Oxford University Press, 2004.</li>
<li class="tugbbl">Bernard Ficatier and Hugues Roche, Concevoir, relever et dessiner des plans de voiliers classiques et traditionnels, Douarnenez: Chasse-mar&#x00e9;e, 2004.</li>
<li class="tugbbl">Richard Furuta, Jeffrey Scofield, and Alan Shaw, Document Formatting Systems: Survey, Concepts, and Issues, Computing Surveys, Vol. 14, No. 3, Sept. 1982, pp. 417&#x2013;472. <a href="https://doi.org/10.1145/356887.356891">doi.org/10.1145/356887.356891</a></li>
<li class="tugbbl">Pierre-Marie Gallois, Quand Paris &#x00c9;tait Ville-Lumi&#x00e8;re, L&#x2019;&#x00c2;ge D&#x2019;homme, 2001.</li>
<li class="tugbbl">Yannis Haralambous, Fonts &#x0026; Encodings, O&#x2019;Reilly, 2007.</li>
<li class="tugbbl">Tamir Hassan, Changyuan Hu, and Roger D. Hersch, Next Generation Typeface Representations: Revisiting Parametric Fonts, ACM DocEng 2010 conference, Sept. 2010, pp. 181&#x2013;184. <a href="https://lspwww.epfl.ch/publications/typography/ngtrrpf_10.pdf">lspwww.epfl.ch/publications/typography/ngtrrpf_10.pdf</a></li>
<li class="tugbbl">Rudolf Hell, Le Digiset, composeuse binaire &#x00e9;lectronique, Caract&#x00e8;re, vol. 16, no. 11, 1965, pp. 5&#x2013;16.</li>
<li class="tugbbl">Roger Hersch (ed.), The Visual and Technical Aspects of Type, Cambridge University Press, 1993. <a href="https://lspwww.epfl.ch/publications/typography/vataot.html">lspwww.epfl.ch/publications/typography/vataot.html</a></li>
<li class="tugbbl">Allen V. Hershey, Calligraphy for Computers, U.S. Naval Weapons Laboratory, 1967, 500pp. <a href="https://archive.org/details/hershey-calligraphy_for_computers">archive.org/details/hershey-calligraphy_for_computers</a></li>
<li class="tugbbl">Allen V. Hershey, A Computer System for Scientific Typography, Computer Graphics and Image Processing, Vol. 1 (1972), pp. 273&#x2013;385.</li>
<li class="tugbbl">John D. Hobby, Digitized Brush Trajectories, Ph.D. thesis, Stanford University, Aug. 1985. <a href="https://tug.org/docs/hobby/hobby-thesis.pdf">tug.org/docs/hobby/hobby-thesis.pdf</a></li>
<li class="tugbbl">John D. Hobby, A User&#x2019;s Manual for MetaPost. AT&#x0026;T Bell Laboratories Computing Science Technical Report 162, 1992. With updates: <a href="https://tug.org/docs/metapost/mpman.pdf">tug.org/docs/metapost/mpman.pdf</a></li>
<li class="tugbbl">Douglas Hofstadter, Metamagical Themas, Basic Books, 1985. <a href="https://archive.org/details/MetamagicalThemas">archive.org/details/MetamagicalThemas</a></li>
<li class="tugbbl">Kris Holmes, Dossier&#x2014;Calligraphy, Lettering, Signage and Graphic Design, Filmmaking and Articles, Keepsake for the Frederic Goudy Award, Rochester Institute of Technology, 2012.</li>
<li class="tugbbl">Changyuan Hu and Roger D. Hersch, Parameterizable Fonts Based on Shape Components, IEEE Computer Graphics and Applications, Vol. 21, No. 3, May/June 2001, pp. 70&#x2013;85. <a href="https://lspwww.epfl.ch/publications/typography/pfbosc.pdf">lspwww.epfl.ch/publications/typography/pfbosc.pdf</a></li>
<li class="tugbbl">Peter Karow, Digital Formats for Typefaces, URW Verlag, Hamburg, 1987. <a href="https://archive.org/details/digitalformatsfo0000karo">archive.org/details/digitalformatsfo0000karo</a></li>
<li class="tugbbl">Peter Karow, Digital punch cutting, Electronic Publishing, Vol. 4, No. 3, Sept. 1991, pp. 151&#x2013;170. <a href="http://cajun.cs.nott.ac.uk/compsci/epo/papers/volume4/issue3/ep044pk.pdf">cajun.cs.nott.ac.uk/compsci/epo/papers/volume4/issue3/ep044pk.pdf</a></li>
<li class="tugbbl">Peter Karow, Digital Typefaces: Description and Fprmats, Springer-Verlag, 1994. <a href="https://books.google.com/books?id=oomrCAAAQBAJ">books.google.com/books?id=oomrCAAAQBAJ</a></li>
<li class="tugbbl">Peter Karow, Two decades of typographic research at URW: A retrospective, in [109, pp. 265&#x2013;304 (1998)].</li>
<li class="tugbbl">Peter Karow, Font Technology: Methods and Tools, Springer Science, 2012.</li>
<li class="tugbbl">Peter Karow, Digital Typography &#x0026; Artificial Intelligence, On the occasion of the presentation of the third Dr. Peter Karow Award for Font Technology &#x0026; Digital Typography to Dr. Donald E. Knuth at the ATypI Amsterdam 2013 conference, Adobe and Dutch Type Library, 2013.</li>
<li class="tugbbl">Brian W. Kernighan, A Typesetter-independent TROFF, Computing Science Technical Report No. 97, Bell Labs, revised, Mar. 1982. <a href="https://archive.org/details/typesetter-independent-troff">archive.org/details/typesetter-independent-troff</a></li>
<li class="tugbbl">Brian W. Kernighan, PIC&#x2014;a language for typesetting graphics, Proceedings of the ACM SIGPLAN SIGOA Symposium on Text Manipulation, June 1981, pp. 92&#x2013;98. <a href="https://doi.org/10.1145/800209.806459">doi.org/10.1145/800209.806459</a> Revised publication, May 1991: <a href="https://archive.org/details/pic-graphics-language">archive.org/details/pic-graphics-language</a></li>
<li class="tugbbl">Brian W. Kernighan and Lorinda L. Cherry, A System for Typesetting Mathematics, Communications of the ACM, Vol. 18, No. 3, Mar. 1975, pp. 151&#x2013;157. <a href="https://dl.acm.org/doi/10.1145/360680.360684">dl.acm.org/doi/10.1145/360680.360684</a></li>
<li class="tugbbl">Christopher Knoth, Computed Type Design, Master Art Direction, ECAL Lausanne, 2011. <a href="https://christoph-knoth.com/shared/computed_type_-_christoph_knoth.pdf">christoph-knoth.com/shared/computed_type_-_christoph_knoth.pdf</a></li>
<li class="tugbbl">Donald E. Knuth, &#x201c;TAU EPSILON CHI: A System for Technical Text&#x201d;, STAN-CS-78-675.1, Computer Science Department, Stanford University, Stanford, California, Nov. 1978. <a href="https://purl.stanford.edu/jy605yq4819">purl.stanford.edu/jy605yq4819</a></li>
<li class="tugbbl">Donald E. Knuth, Mathematical Typography, Bulletin (N.S.) of the American Mathematical Society, Vol. 1, No. 2, 1979, pp. 337&#x2013;372. <a href="https://doi.org/10.1090/S0273-0979-1979-14598-1">doi.org/10.1090/S0273-0979-1979-14598-1</a></li>
<li class="tugbbl">Donald E. Knuth, TeX and Metafont&#x2014;New directions in typesetting, Digital Press and American Mathematical Society, 1979.</li>
<li class="tugbbl">Donald E. Knuth, The Letter S, The Mathematical Intelligencer, Vol. 2 (1980), pp. 114&#x2013;122.</li>
<li class="tugbbl">Donald E. Knuth, The Concept of a Meta-Font, Visible Language, Vol. 16, No. 1, Jan. 1982, pp. 3-27. <a href="https://journals.uc.edu/index.php/vl/article/view/5329">journals.uc.edu/index.php/vl/article/view/5329</a></li>
<li class="tugbbl">Donald E. Knuth, The Metafontbook, Computers &#x0026; Typesetting, Reading, MA: Addison-Wesley, 1986.</li>
<li class="tugbbl">Donald E. Knuth, Computer Modern Typefaces, Reading, MA: Addison-Wesley, 1986.</li>
<li class="tugbbl">Donald E. Knuth, A Punk Meta-Font, TUGboat, Vol. 9 (1988), No. 2, pp. 152&#x2013;168. <a href="https://tug.org/TUGboat/tb09-2/tb21knut.pdf">tug.org/TUGboat/tb09-2/tb21knut.pdf</a></li>
<li class="tugbbl">Donald E. Knuth, Digital Typography, xvi+685pp. CSLI Lecture Notes, no. 78, Stanford, California, 1999.</li>
<li class="tugbbl">Eliyezer Kohen, A simple and efficient way to design middle resolution fonts, in [17, pp. 3&#x2013;19] and [109, pp. 22&#x2013;33 (1989)].</li>
<li class="tugbbl">Sacha Krakowiak, Xerox PARC et la naissance de l&#x2019;informatique contemporaine, Interstices (revue Inria en ligne), 2012. <a href="https://interstices.info/jcms/int_64091/xerox-parc-et-la-naissance-de-l-informatique-contemporaine">interstices.info/jcms/int_64091/xerox-parc-et-la-naissance-de-l-informatique-contemporaine</a></li>
<li class="tugbbl">Gerry Leonidas, Farewell, Richard Southall, 17 June 2015. <a href="https://leonidas.net/2015/06/17/farewell-richard-southall/">leonidas.net/2015/06/17/farewell-richard-southall/</a></li>
<li class="tugbbl">Raph Levien and Carlo H. S&#x00E9;quin, Interpolating Splines: Which is the fairest of them all?, Computer-Aided Design &#x0026; Applications, Vol. 6, No. 1, 2009, pp. 91&#x2013;102. <a href="http://graphics.berkeley.edu/papers/Levien-IIS-2009-06/">graphics.berkeley.edu/papers/Levien-IIS-2009-06/</a></li>
<li class="tugbbl">Pierre MacKay, The KATIB System, a revolutionary advancement in Arabic script typesetting by means of the computer, Scholarly Publishing Vol. 8, No. 2, 1977, pp. 142&#x2013;150.</li>
<li class="tugbbl">Pierre A. MacKay, Looking at the Pixels. Quality Control for 300 dpi Laser Printer Fonts, Especially Metafonts, in [109, pp. 205&#x2013;217 (1991)].</li>
<li class="tugbbl">Julien Mailland and Kevin Driscoll, Minitel: The Online World France Built Before the Web, 20 June 2017. <a href="https://spectrum.ieee.org/minitel-the-online-world-france-built-before-the-web">spectrum.ieee.org/minitel-the-online-world-france-built-before-the-web</a></li>
<li class="tugbbl">Ladislas Mandel, Un caract&#x00e8;re pour annuaires t&#x00e9;l&#x00e9;phoniques, Communication et langages, n&#x00b0; 39, 1979, pp. 51&#x2013;61.</li>
<li class="tugbbl">Ladislas Mandel, Naissance d&#x2019;une &#x00e9;criture &#x2013; R&#x00e9;flexions sur la typographie et la t&#x00e9;l&#x00e9;matique, dans L&#x2019;&#x00e9;criture t&#x00e9;l&#x00e9;matique, ann&#x00e9;es z&#x00e9;ro [35, pp. 41&#x2013;49].</li>
<li class="tugbbl">Ladislas Mandel, Du pouvoir de l&#x2019;&#x00e9;criture, Atelier Perrousseaux &#x00e9;d., 1998.</li>
<li class="tugbbl">Marie Marchand, La Grande Aventure du Minitel, Librairie Larousse, 1987.</li>
<li class="tugbbl">M. V. Mathews, Carol Lochbaum, and Judith A. Moss, Array: Three Fonts of Computer-drawn Letters, The Journal of Typographic Research, Vol. 1, No. 4, Oct. 1967, pp. 345&#x2013;356. <a href="https://journals.uc.edu/index.php/vl/article/view/5008">journals.uc.edu/index.php/vl/article/view/5008</a></li>
<li class="tugbbl">Paul McJones, Xerox Alto file system archive, Computer History Museum, last revised 9 Nov. 2017. <a href="https://xeroxalto.computerhistory.org">xeroxalto.computerhistory.org</a></li>
<li class="tugbbl">H.W. Mergler and P.M. Vargo, One Approach to Computer Assisted Letter Design, The Journal of Typographic Research, Vol. 2, No. 4, Oct. 1968, pp. 299&#x2013;322. <a href="https://journals.uc.edu/index.php/vl/article/view/5032">journals.uc.edu/index.php/vl/article/view/5032</a></li>
<li class="tugbbl">Stanley Morison, On Some Italian Scripts of the XV and XVI Centuries, in Letter forms, typographic and scriptorial: Two essays on their classification, history, and bibliography, Typophiles, pp. 95&#x2013;129, 1968.</li>
<li class="tugbbl">Heidrun Osterer and Philipp Stamm, Adrian Frutiger &#x2013; Caract&#x00e8;res: L&#x2019;&#x0153;uvre Compl&#x00e8;te, Walter de Gruyter, Switzerland, 2012.</li>
<li class="tugbbl">Victor Ostromoukhov and Jacques Andr&#x00e9;, Punk : de Metafont &#x00e0; PostScript, Cahiers GUTenberg, n&#x00b0; 4 (1989), pp. 23&#x2013;28. <a href="http://numdam.org/item/CG_1989___4_23_0/">numdam.org/item/CG_1989___4_23_0/</a></li>
<li class="tugbbl">Scott Pakin, The Comprehensive LaTeX Symbol List, 2021. <a href="https://ctan.org/pkg/comprehensive">ctan.org/pkg/comprehensive</a></li>
<li class="tugbbl">Arthur Phillips, Computer Peripherals &#x0026; Typesetting, London, Her Majesty&#x2019;s Stationery Office, 1968.</li>
<li class="tugbbl">Vaughan Pratt, Techniques for conic splines, ACM SIGGRAPH Computer Graphics, Vol. 19, No. 3, July 1985, pp. 151&#x2013;159. <a href="https://doi.org/10.1145/325165.325225">doi.org/10.1145/325165.325225</a></li>
<li class="tugbbl">Lilian M.C. Randall, A Nineteenth Century &#x2018;Medieval&#x2019; Prayerbook Woven in Lyon, in Art the Ape of Nature: Studies in Honor of H.W. Janson, Moshe Barasch, Lucy F. Sandler (eds), New York, NY: Harry N. Abrams, 1981, pp. 651&#x2013;668.</li>
<li class="tugbbl">Brian K. Reid and David Hanson, An annotated bibliography of background material on text manipulation, Proceedings of the ACM SIGPLAN SIGOA Symposium on Text Manipulation, ACM SIGPLAN Notices, Vol. 16, No. 6, June 1981, pp. 157&#x2013;160. <a href="https://doi.org/10.1145/800209.806467">doi.org/10.1145/800209.806467</a></li>
<li class="tugbbl">RIDT, conference series proceedings: 
<br>&#x2022;Raster Imaging and Digital Typography, Lausanne, Oct. 1989 (Jacques Andr&#x00e9; and Roger Hersch, eds.), Cambridge University Press, 1989. <a href="https://books.google.com/books?id=mj09AAAAIAAJ">books.google.com/books?id=mj09AAAAIAAJ</a> 
<br>&#x2022;Raster Imaging and Digital Typography II, Boston, Oct. 1991 (Robert A. Morris and Jacques Andr&#x00e9;, eds.), Cambridge University Press, 1991. <a href="https://books.google.com/books?id=Q9KtGcpfNgUC">books.google.com/books?id=Q9KtGcpfNgUC</a> 
<br>&#x2022;Raster Imaging and Digital Typography, special issue of Electronic Publishing Origination Dissemination and Design, (Jacques Andr&#x00e9;, Jakob Gonczarowski, and Richard Southall, eds.), Wiley, 1994. <a href="https://books.google.com/books?id=gJcVAQAAIAAJ">books.google.com/books?id=gJcVAQAAIAAJ</a> 
<br>&#x2022;Electronic Publishing, Artistic Imaging, and Digital Typography (Roger Hersch, Jacques Andr&#x00e9;, and Heather Brown, eds.), Lecture Notes in Computer Science #1375, Springer-Verlag, 1998. <a href="https://books.google.com/books?id=bo453EDNBp4C">books.google.com/books?id=bo453EDNBp4C</a></li>
<li class="tugbbl">Frank Romano (with Miranda Mitrano), History of Desktop Publishing, Oak Knoll Press, 2019.</li>
<li class="tugbbl">Richard Rubinstein, Digital Typography&#x2014;an introduction to type and composition for computer system design, Reading, MA: Addison-Wesley, 1988.</li>
<li class="tugbbl">Lynn Ruggles, Letterform Design Systems, Stanford University Technical Report STAN-CS-83-971, 1973. <a href="http://i.stanford.edu/pub/cstr/reports/cs/tr/83/971/CS-TR-83-971.pdf">i.stanford.edu/pub/cstr/reports/cs/tr/83/971/CS-TR-83-971.pdf</a></li>
<li class="tugbbl">Stewart C. Russell, Hershey Font Outlines, May 2014. <a href="https://scruss.com/wordpress/wp-content/uploads/2014/05/hershey_samples.pdf">scruss.com/wordpress/wp-content/uploads/2014/05/hershey_samples.pdf</a></li>
<li class="tugbbl">John Seybold and Fritz Dressler, Publishing From the Desktop, New York, NY: Bantam Books, 1987. <a href="https://archive.org/details/publishingfromde0000seyb">archive.org/details/publishingfromde0000seyb</a></li>
<li class="tugbbl">Richard Southall, Interfaces between the designer and the document, in Structured documents (Jacques Andr&#x00e9;, Richard Furuta, and Vincent Quint, eds.), Cambridge University Press, 1989, pp. 119&#x2013;131. <a href="https://dl.acm.org/doi/10.5555/73173.73179">dl.acm.org/doi/10.5555/73173.73179</a></li>
<li class="tugbbl">Richard Southall, Metafont in the Rockies: The Colorado Typemaking Project, in EP&#x2019;98 [109, pp. 167&#x2013;180 (1998)]; <a href="https://link.springer.com/chapter/10.1007%2FBFb0053270">link.springer.com/chapter/10.1007%2FBFb0053270</a> Republished in Computers and Typography 2 (Rosemary Sassoon, ed.), Intellect Books, 2002; <a href="https://books.google.com?id=wdYmvQD5C8IC">books.google.com?id=wdYmvQD5C8IC</a></li>
<li class="tugbbl">Richard Southall, Printer&#x2019;s Type in the Twentieth Century&#x2014;Manufacturing and Design Methods, The British Library/Oak Knoll Press, 2005.</li>
<li class="tugbbl">Bob Sproull, Font Representations and Formats, Internal note, Xerox PARC, Mar. 1977. <a href="https://xeroxparcarchive.computerhistory.org/indigo/printingdocs/.FONTFORMATS.PRESS!1.pdf">xeroxparcarchive.computerhistory.org/indigo/printingdocs/.FONTFORMATS.PRESS!1.pdf</a></li>
<li class="tugbbl">David R. Siegel, The Euler Project at Stanford, The Department of Computer Science, Stanford University, Stanford, 1985.</li>
<li class="tugbbl">David Sudweeks, Type Trends: Superelliptical Type, FontShop Typographic Trends, Nov. 2012. <a href="https://fontshopblog.wordpress.com/2012/11/22/type-trends-superelliptical-type">fontshopblog.wordpress.com/2012/11/22/type-trends-superelliptical-type</a></li>
<li class="tugbbl">Edward Tufte, Visual Explanations&#x2014;Images and Quantities, Evidence and Narrative, Cheshire, CT: Graphic Press, 1997.</li>
<li class="tugbbl">Gerard Unger, The Design of a Typeface, Visible Language, Vol. 13, No. 2, Apr. 1979, pp. 134&#x2013;149. <a href="https://journals.uc.edu/index.php/vl/article/view/5266">journals.uc.edu/index.php/vl/article/view/5266</a></li>
<li class="tugbbl">Gerard Unger, in Other Replies to Donald E. Knuth&#x2019;s article &#x201c;The Concept of a Meta-Font&#x201d;, Visible Language, Vol. 16, No. 4, Oct. 1982, pp. 353&#x2013;356. <a href="https://journals.uc.edu/index.php/vl/issue/view/360">journals.uc.edu/index.php/vl/issue/view/360</a></li>
<li class="tugbbl">Andries Van Dam and Eric E. Rice, On-line Text Editing: A Survey, Computing Surveys, Vol. 3, No. 3, Sept. 1971, pp. 93&#x2013;114. <a href="https://doi.org/10.1145/356589.356591">doi.org/10.1145/356589.356591</a></li>
<li class="tugbbl">Yue Wang, Interview with Charles Bigelow, TUGboat, Vol. 34 (2013), No. 2, pp. 136&#x2013;167. <a href="https://tug.org/TUGboat/tb34-2/tb107bigelow-wang.pdf">tug.org/TUGboat/tb34-2/tb107bigelow-wang.pdf</a></li>
<li class="tugbbl">Matthew Westerby, The Woven Prayer Book: Cocoon to Codex, Satellite Series. Paris, France &#x0026; Chicago, IL, USA: Les Enluminures, 2019.</li>
<li class="tugbbl">Norman M. Wolcott and Joseph Hilsenrath, A Contribution to Computer Typesetting Techniques: Tables of coordinates for Hershey&#x2019;s Repertory of Occidental Type Fonts and Graphic Symbols, National Bureau of Standards, NBS Special Publication 424, Apr. 1976. <a href="https://scruss.com/wordpress/wp-content/uploads/2014/04/tables_of_coordinates_for_hersheys_repertory_of_occidental_type_fonts-wolcott_and_hilsenrath.pdf">scruss.com/wordpress/wp-content/uploads/2014/04/tables_of_coordinates_for_hersheys_repertory_of_occidental_type_fonts-wolcott_and_hilsenrath.pdf</a></li>
<li class="tugbbl">Norman M. Wolcott, FORTRAN IV Enhanced Character Graphics, National Bureau of Standards, Institute for Computer Sciences and Technology, NBS Special Publication 500-32, Apr. 1978, 64 pp. <a href="https://archive.org/details/fortranivenhance5003wolc">archive.org/details/fortranivenhance5003wolc</a></li>
<li class="tugbbl">Hermann Zapf, Hermann Zapf and His Design Philosophy, Chicago, IL: Society of Typographic Arts, 1987. Introduction by Carl Zahn.</li>
<li class="tugbbl">Herman Zapf, Vom Formgesetz der Renaissance-Antiqua, Der Polygraph, Heft 21.</li>
</ol>

<hr><small><a href="/TUGboat/">TUGboat</a> 44:1, 2023 (<a href="/TUGboat/tb44-1/">issue 136</a>)
&nbsp; [generated 2023-05-17]
</small><br><!--#include virtual="/footer.html"-->
